# Soal Nomor 1

In [1]:
string = ''
for i in range(1, 101):
    if (i%3==0 and i%5==0):
        string += 'ApaBole, '
    elif (i%3==0):
        string += 'Apa, '
    elif (i%5==0):
        if(i==100):
            string += 'Bole'
        else:
            string += 'Bole, '
    else:
        string += str(i)+', ' 
        
print(string)

1, 2, Apa, 4, Bole, Apa, 7, 8, Apa, Bole, 11, Apa, 13, 14, ApaBole, 16, 17, Apa, 19, Bole, Apa, 22, 23, Apa, Bole, 26, Apa, 28, 29, ApaBole, 31, 32, Apa, 34, Bole, Apa, 37, 38, Apa, Bole, 41, Apa, 43, 44, ApaBole, 46, 47, Apa, 49, Bole, Apa, 52, 53, Apa, Bole, 56, Apa, 58, 59, ApaBole, 61, 62, Apa, 64, Bole, Apa, 67, 68, Apa, Bole, 71, Apa, 73, 74, ApaBole, 76, 77, Apa, 79, Bole, Apa, 82, 83, Apa, Bole, 86, Apa, 88, 89, ApaBole, 91, 92, Apa, 94, Bole, Apa, 97, 98, Apa, Bole

# Soal Nomor 2

In [2]:
import pandas as pd

df_sample = pd.read_csv('sample_problem.csv')
df_sample_output = pd.read_csv('sample_output.csv')

In [3]:
df_sample

  user_name  transaction_value transaction_date
0       Foo                 50       2022-01-10
1       Bar                100       2022-01-01
2     Alice                 75       2022-01-26
3       Bob                 20       2022-02-05
4       Bar                 40       2022-01-01
5     Alice                 50       2022-01-01
6       Bob                 80       2022-01-04
7     Alice                 95       2022-01-01

In [4]:
df_sample_output

  user_name  transaction_value last_transaction_date
0       Foo                 50            2022-01-10
1       Bar                140            2022-01-01
2     Alice                220            2022-01-26
3       Bob                100            2022-02-05

In [5]:
print('Info Data Awal')
df_sample.info()

Info Data Awal
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_name          8 non-null      object
 1   transaction_value  8 non-null      int64
 2   transaction_date   8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [6]:
print('Info Data Target Output')
df_sample_output.info()

Info Data Target Output
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   user_name              4 non-null      object
 1   transaction_value      4 non-null      int64
 2   last_transaction_date  4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

Berdasarkan pada data sample_output, terdapat perbedaan dengan data sample_problem. Perbedaan tersebut yaitu sebagai berikut :

1. Data sample_output merupakan hasil grouping berdasarkan unique pada kolom user_name
2. Perbedaan Nama kolom transaction_date antara sample_problem dan sample_output. Pada data sample_output nama kolomnya menjadi last_transaction_date yang mana baris dari kolom tersebut merupakan tanggal transaksi terakhir dari tiap unique pada kolom user_name.
3. Pada kolom transaction_value dari data sample_output merupakan hasil sum atau penjumlahan nilai transaksi dari tiap unique pada kolom user_name

### Step 1. Rubah tipe data pada kolom transaction_date

In [7]:
df_sample['transaction_date']= pd.to_datetime(df_sample['transaction_date'])
print(df_sample)
print(df_sample.info())

  user_name  transaction_value transaction_date
0       Foo                 50       2022-01-10
1       Bar                100       2022-01-01
2     Alice                 75       2022-01-26
3       Bob                 20       2022-02-05
4       Bar                 40       2022-01-01
5     Alice                 50       2022-01-01
6       Bob                 80       2022-01-04
7     Alice                 95       2022-01-01
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_name          8 non-null      object
 1   transaction_value  8 non-null      int64
 2   transaction_date   8 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 320.0+ bytes
None

### Step 2. Menjumlahkan nilai 'transaction_value' berdasarkan setiap unique 'user_name'

In [8]:
df_sample_tvalue = df_sample.groupby('user_name', as_index = False, sort = False)['transaction_value'].sum()
df_sample_tvalue

  user_name  transaction_value
0       Foo                 50
1       Bar                140
2     Alice                220
3       Bob                100

### Step 3. Mengambil nilai 'transaction_date' terakhir berdasarkan setiap unique pada kolom 'user_name' dan mengganti nama kolom menjadi 'last_transaction_date'

In [9]:
df_sample_tdate = df_sample.loc[df_sample.groupby('user_name', sort = False).transaction_date.idxmax()]
df_sample_tdate.rename(columns={'transaction_date':'last_transaction_date'}, inplace=True)
df_sample_tdate = df_sample_tdate.drop(['transaction_value'], axis = 1)
df_sample_tdate

  user_name last_transaction_date
0       Foo            2022-01-10
1       Bar            2022-01-01
2     Alice            2022-01-26
3       Bob            2022-02-05

### Step 4. Penggabungan data

In [10]:
df_final = pd.merge(df_sample_tvalue, df_sample_tdate, on='user_name')
df_final

  user_name  transaction_value last_transaction_date
0       Foo                 50            2022-01-10
1       Bar                140            2022-01-01
2     Alice                220            2022-01-26
3       Bob                100            2022-02-05

### Step 5. Cek kesamaan isi data

In [11]:
df_final == df_sample_output

   user_name  transaction_value  last_transaction_date
0       True               True                   True
1       True               True                   True
2       True               True                   True
3       True               True                   True

### Step 6. Cek kesamaan tipe data

In [12]:
df_final.dtypes == df_sample_output.dtypes

user_name                 True
transaction_value         True
last_transaction_date    False
dtype: bool

Dapat dilihat bahwa pada bagian isi sudah memiliki kesamaan, namun pada tipe data pada kolom last_transaction_date memiliki perbedaan tipe data.

### Step 7. Menyamakan tipe data pada kolom 'last_transaction_date'

In [13]:
df_final['last_transaction_date'] = pd.to_datetime(df_final['last_transaction_date']).dt.date

In [14]:
df_final.dtypes == df_sample_output.dtypes

user_name                True
transaction_value        True
last_transaction_date    True
dtype: bool

### Hasil Akhir Data

In [15]:
df_final

  user_name  transaction_value last_transaction_date
0       Foo                 50            2022-01-10
1       Bar                140            2022-01-01
2     Alice                220            2022-01-26
3       Bob                100            2022-02-05